robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2FOC-V3_6/src/2FOC.c
    /////////////////////////////////////
    
    *IqRef = IqRef_fake;
    
    return (7200 + encoder_fake) % 360;
}

// DMA0 IRQ Service Routine used for FOC loop

volatile short Ia = 0, Ib = 0, Ic = 0;
volatile short Va = 0, Vb = 0, Vc = 0;

volatile int VqFbk = 0;
volatile int IqFbk = 0;

void __attribute__((__interrupt__, no_auto_psv)) _DMA0Interrupt(void)
{
    int Vq = 0;

    static const int cos_table[] = {32767,32763,32748,32723,32688,32643,
                                    32588,32523,32449,32364,32270,32165,
                                    32051,31928,31794,31651,31498,31336,
                                    31164,30982,30791,30591,30381,30163,
                                    29935,29697,29451,29196,28932,28659,28377};
    
    static const int sin_table[] = {    0,  330,  660,  990, 1319, 1648,
                                     1977, 2305, 2632, 2959, 3285, 3609, 
                                     3933, 4255, 4576, 4896, 5214, 5531, 
                                     5846, 6159, 6470, 6779, 7087, 7392, 
                                     7694, 7995, 8293, 8588, 8881, 9171, 9459};
    
    volatile static short *iH, *iL, *i0;
    volatile static short *ppwmH, *ppwmL, *ppwm0;
    
    // setting CORCON in this way rather than using CORCONbits is
    // slightly more efficient (because CORCONbits is volatile and
    // optimizer cannot collapse multiple bit operations)
    CORCON = 0b11110100;

    // read and compensate ADC offset by MeasCurrParm.Offseta, Offsetb, Offsetc
    // scale currents by MeasCurrParm.qKa, qKb, qKc
    // Calculate ParkParm.qIa, qIb, qIc
    ParkParm.qIa = (int)((__builtin_mulss(MeasCurrParm.Offseta-ADCBuffer[0],MeasCurrParm.qKa)+8192L)>>14); 
    ParkParm.qIc = (int)((__builtin_mulss(MeasCurrParm.Offsetc-ADCBuffer[1],MeasCurrParm.qKc)+8192L)>>14);
    ParkParm.qIb = -ParkParm.qIa-ParkParm.qIc;
    
    // qIx = 64 is equal to 50 mA current here
    // since we have 10 bits resolution, left aligned, with LSB = 50 mA
    
    // gain = 64/49.03
    
    static short Ia_old = 0, Ib_old = 0, Ic_old = 0;
    
    Ia = (ParkParm.qIa + Ia_old)/3;
    Ib = (ParkParm.qIb + Ib_old)/3;
    Ic = (ParkParm.qIc + Ic_old)/3;
    
    // gain = (64/49.03) * (2/3)
    
    Ia_old = ParkParm.qIa;
    Ib_old = ParkParm.qIb;
    Ic_old = ParkParm.qIc;
        
    int sector = 0;
    int delta  = 0;
    
    if (MotorConfig.has_qe)
    {
        if (MotorConfig.has_index)
        {
            // QE + Index
            int angle = 0;
            
            if (sAlignInProgress)
            {
                angle = alignRotorIndex(&IqRef);
            }
            else
            {
                angle = QEgetElettrDeg();
            }
            
            sector = 1 + angle/60;
            
            delta = angle%60-30;
        }
        else if (MotorConfig.has_hall)
        {
            // QE and HALL
            
            sector = DHESSector();
              
            static int sector_old = 0;
            
            if (sector != sector_old)
            {
                if (sector_old == 6 && sector == 1)
                {
                    QEHESCrossed(1);
                }
                else if (sector_old == 1 && sector == 6)
                {
                    QEHESCrossed(0);
                }
                
                sector_old = sector;
            }
            
            if (QEready())
            {
                int angle = QEgetElettrDeg();
                    
                sector = 1 + angle/60;
                delta = angle%60 - 30;
            }
            else
            {
                if (gEncoderConfig.offset)
                {
                    int angle = ((sector-1)*60 + 30 + gEncoderConfig.offset) % 360;
            
                    sector = 1 + angle/60;
                    delta = angle%60 - 30;
                }
                else
                {
                    delta = 0;
                }
            }    
        }
        //else CONFIGURATION ERROR
    }
    else if (MotorConfig.has_hall)
    {
        // only HALL
        
        sector = DHESSector();
        delta = 0;
        
        if (gEncoderConfig.offset)
        {
            int angle = ((sector-1)*60 + 30 + gEncoderConfig.offset) % 360;
            
            sector = 1 + angle/60;
            delta = angle%60 - 30;
        }
    }
    
    BOOL has_speed_sample = updateOdometry();
    
    static char sector_stored = 0;

    if (sector_stored != sector)
    {                
        sector_stored = sector;
        
        #define HI(Ix,Vx) iH = &Ix; ppwmH = &Vx;
        #define LO(Ix,Vx) iL = &Ix; ppwmL = &Vx;
        #define NE(Ix,Vx) i0 = &Ix; ppwm0 = &Vx;
        
        switch (sector) // original
        {
            case 1: HI(Ia,Va) LO(Ib,Vb) NE(Ic,Vc) break; // 1 0 1   5 -> 1
            case 2: HI(Ia,Va) LO(Ic,Vc) NE(Ib,Vb) break; // 1 0 0   4 -> 2
            case 3: HI(Ib,Vb) LO(Ic,Vc) NE(Ia,Va) break; // 1 1 0   6 -> 3
            case 4: HI(Ib,Vb) LO(Ia,Va) NE(Ic,Vc) break; // 0 1 0   2 -> 4
            case 5: HI(Ic,Vc) LO(Ia,Va) NE(Ib,Vb) break; // 0 1 1   3 -> 5
            case 6: HI(Ic,Vc) LO(Ib,Vb) NE(Ia,Va) break; // 0 0 1   1 -> 6
        }
    }
    
    int sinT,cosT;

    if (delta<0)
    {
        cosT =  cos_table[-delta];
        sinT = -sin_table[-delta];
    }
    else
    {
        cosT =  cos_table[ delta];
        sinT =  sin_table[ delta];
    }
    
    if (sector%2) 
    {
        // gain = (64/49.03) * (2/3) * (2/sqrt3) = 1.0048 OK!
        
        I2Tdata.IQMeasured = /* sqrt3/2 */  (int)((__builtin_mulss(*iH-*iL,cosT)-__builtin_mulss( *i0 ,3*sinT)+16384L)>>15);
        I2Tdata.IDMeasured = /* 3/2 */     -(int)((__builtin_mulss(  *i0  ,cosT)+__builtin_mulss(*iH-*iL,sinT)+16384L)>>15);
    }
    else
    {
        I2Tdata.IQMeasured = /* sqrt3/2 */  (int)((__builtin_mulss(*iH-*iL,cosT)+__builtin_mulss( *i0 ,3*sinT)+16384L)>>15);
        I2Tdata.IDMeasured = /* 3/2 */      (int)((__builtin_mulss(  *i0  ,cosT)-__builtin_mulss(*iH-*iL,sinT)+16384L)>>15);
    }
    
